Repository: necrose99/Myaamia
Catalog: ilda_full.tmx
Source language: mia
Languages: en_us

source: wintee-
en_us: It boils

source: yaalanwihsink-
en_us: Pentagon

source: -šihs-
en_us: Uncle (mother's brothers)

source: -šiikan-
en_us: Butt, buttocks

source: -šiipit-
en_us: Earring, ear pendant

source: šaah-
en_us: Sioux, Lakota person

source: šaahkweehsi-
en_us: Yellow-bellied Sapsucker (Sphyrapicus varius)

source: šaahtee-
en_us: It is wilted, withered (of plants)

source: šaahšaakweehsi-
en_us: garter snake

source: šaakonam-
en_us: crack it by hand

source: šaakosam-
en_us: Burn it

source: šaakwaci-
en_us: Be cold

source: šaakwalet-
en_us: it rots, decays

source: šaakwiteehee-
en_us: Have a broken heart

source: šaakwiteeheehpinal-
en_us: Cause him to be mournful, break his heart

source: šaankomehkw-
en_us: Purple Martin (Progne subis)

source: šaaponaakan-
en_us: Needle, pin

source: šaapontiohsee-
en_us: it is a laxative

source: šaapwaahkwihtaw-
en_us: Hear him through something

source: šaawanw-
en_us: Shawnee person

source: šaawe
en_us: immediately, right away

source: šaaweekonci
en_us: From the beginning, from the start

source: šaay-
en_us: Already, come to pass, goodbye

source: šaašaašhkweekaan-
en_us: Court house

source: šaašaašhkwi-
en_us: Judge

source: šaašihkaapantani-
en_us: It appears correct, it looks good

source: šaašihkwee-
en_us: Judge, decide

source: šahkamoolition-
en_us: Communion

source: šakwapawee-
en_us: be wet, damp

source: šayiipaaw-
en_us: Morning

source: šeešaakamiš-
en_us: american beech tree (Fagus grandifolia)

source: šiihšahw-
en_us: Sting him

source: šiihšiikimeewinš-
en_us: Red Maple (Acer rubrum)

source: šiihšiikwan-
en_us: Rattle

source: šiihšiikweekihs-
en_us: Box Elder tree (Acer negundo)

source: šiihšiikwi-
en_us: Massasauga (Sistrurus catenatus)

source: šiihšiikwia
en_us: Eastern massasauga rattlesnake (Sisturus catenatus)

source: šiihšiip-
en_us: Duck

source: šiihšiipalw-
en_us: Duck Shot

source: šiinkilaweelintam-
en_us: Hate it

source: šiinšiilawee-
en_us: Be strong

source: šiinšiilaweetoo-
en_us: Strengthen it

source: šiinšiiwahwi-
en_us: Paddle strongly

source: šiipantee-
en_us: Be late, gone for a long time

source: šiipeekaakanaahkw-
en_us: Tent peg

source: šiipii-
en_us: Stretch oneself

source: šiipilaan-
en_us: Rain for a long time

source: šiipisam-
en_us: Cook it for a long time

source: šiipohsee-
en_us: Walk for a long time

source: šiišiipii-
en_us: Do stretching exercises

source: šiišonam-
en_us: Rub it in, anoint it

source: šiišonamaw-
en_us: Smear it on him

source: šiišwahaakan-
en_us: Paint brush

source: šikaakonki
en_us: Chicago

source: šikaakw-
en_us: Skunk (Mephitis mephitis), Garlic (Allium spp.), Wild Ramp

source: šikaakwa siipiiw-
en_us: Des Plaines River (Illinois)

source: šikaakwinš-
en_us: Skunk cabbage (Symplocarpus foetidus L. Nutt.)

source: šiki-
en_us: Urinate, pee

source: šikikaan-
en_us: Bathroom, restroom (public)

source: šikinay-
en_us: Urine

source: šikwalalaanti-
en_us: Tadpole

source: šimaakan-
en_us: Lance, Spear

source: šimaakanehsi-
en_us: Soldier

source: šinkilaakan-
en_us: Plate, platter

source: šinkiphs-
en_us: American Coot (Fulica americana), Pied-billed grebe (Podilymbus podiceps)

source: šinkohs-
en_us: American Mink (Neovison vison)

source: šinkw-
en_us: Gum, Resin, Wax

source: šinkwaahkw-
en_us: Eastern red cedar (Juniperus virginiana)

source: šoohkaham-
en_us: Drag it

source: šoohkwaahkaakan-
en_us: Snowsnake (object)

source: šoohkwaahkii-
en_us: Play snowsnake

source: šoohkwaakan-
en_us: Sled, Wagon

source: šoohkwaakanapi-
en_us: Ride in a car, travel by car

source: šool-
en_us: Money

source: šooli mootay-
en_us: Wallet, purse

source: šoolikaan-
en_us: Bank

source: šoowikontaakan-
en_us: Have a sore throat

source: šoowilakiši-
en_us: Have a bellyache, stomach ache

source: šoowintepikan-
en_us: Have a headache

source: šoowiteehee-
en_us: Worry, have an aching heart

source: šoowiyosi-
en_us: Be sore, ache

source: šoošookwalalaakan-
en_us: Kentucky Coffee Tree bean

source: šoošookwalalaakanišaahkw-
en_us: kentucky coffee tree (Gymnocladus diocus)

source: šowaapinam-
en_us: there is a tornado, a big wind
